In [12]:
%load_ext sql
%sql sqlite:///practice.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [9]:
%reload_ext sql
%config SqlMagic.style = '_DEPRECATED_DEFAULT'
%sql sqlite:///practice.db

# This is for how to use **SELECT** statements in SQL.

In [ ]:
# Sytax:

# SELECT column1, column2
# FROM table_name;

In [ ]:
%%sql
-- All employees
SELECT * FROM employees;

 * sqlite:///practice.db
Done.

[(1, 'Alice', 1, 90000, '2018-03-21'),
 (2, 'Bob', 1, 80000, '2019-07-15'),
 (3, 'Charlie', 2, 65000, '2020-01-10'),
 (4, 'Dana', 3, 70000, '2017-09-05'),
 (5, 'Eve', None, 72000, '2021-11-23')]

In [16]:
%%sql
-- Just names and salaries of employees
SELECT name, salary from employees;

 * sqlite:///practice.db
Done.

[('Alice', 90000),
 ('Bob', 80000),
 ('Charlie', 65000),
 ('Dana', 70000),
 ('Eve', 72000)]

In [23]:
%%sql
-- Use an alias
SELECT name as employee_name, salary as pay from employees;

 * sqlite:///practice.db
Done.

[('Alice', 90000),
 ('Bob', 80000),
 ('Charlie', 65000),
 ('Dana', 70000),
 ('Eve', 72000)]

In [ ]:
# Exercises:

# 1. Select all product names and prices. 
# 2. List all customers' names and cities. 
# 3. Select distinct department ids from employees.

In [33]:
%%sql
-- first show table
SELECT * FROM products;

 * sqlite:///practice.db
Done.

[(1, 'Laptop', 'Electronics', 1200.0),
 (2, 'Mouse', 'Electronics', 25.0),
 (3, 'Mug', 'Home', 8.5),
 (4, 'Notebook', 'Stationery', 3.5)]

In [34]:
%%sql
-- first show table
SELECT * FROM customers;

 * sqlite:///practice.db
Done.

[(1, 'Acme Corp', 'London'),
 (2, 'Bright Co', 'Berlin'),
 (3, 'Cafe 123', 'Paris')]

In [36]:
%%sql
-- first show table
SELECT * FROM employees;

 * sqlite:///practice.db
Done.

[(1, 'Alice', 1, 90000, '2018-03-21'),
 (2, 'Bob', 1, 80000, '2019-07-15'),
 (3, 'Charlie', 2, 65000, '2020-01-10'),
 (4, 'Dana', 3, 70000, '2017-09-05'),
 (5, 'Eve', None, 72000, '2021-11-23')]

# Answers

In [35]:
%%sql
-- 1
SELECT name, price from products;

-- 2
SELECT name, city from customers;

 * sqlite:///practice.db
Done.
Done.

[('Acme Corp', 'London'), ('Bright Co', 'Berlin'), ('Cafe 123', 'Paris')]

In [37]:
%%sql
SELECT DISTINCT dept_id from employees;

 * sqlite:///practice.db
Done.

[(1,), (2,), (3,), (None,)]

# Solutions

In [ ]:
# SELECT name, price FROM products;

# SELECT name, city FROM customers;

# SELECT DISTINCT dept_id FROM employees;